import time
import os

os.environ['PYGAME_HIDE_SUPPORT_PROMPT'] = "hide"
clips = os.listdir('loop')

from gtts import gTTS

import pygame
import random

#Line Notify
import requests

#PRW2 Token
url = 'https://notify-api.line.me/api/notify'
token = 'AQaMH3QBpt26fMtJajb0FAusthjXwAhZ7eMcDGZuriT'
headers = {'content-type':'application/x-www-form-urlencoded','Authorization':'Bearer '+token}
#main_volume = 0.05

reply_path = 'reply'
comment_path = 'comment'
comment_error_path = 'error'

loop_path = 'loop'

sound_ext = '.ogg'

play_background_music = False

# Remove stale_comments
stale_comments = os.listdir(comment_path)
for file in stale_comments:
    try:
        os.remove(os.path.join(comment_path, file))
    except:
        print('['+time.strftime('%H:%M')+'][FATAL ERROR] ลบไฟล์เก่าไม่ได้ ' + file)
        try:
            r = requests.post(url, headers=headers, data = {'message': 'มีไฟล์ที่ลบไม่ได้ '+file})
        except:
            print('['+time.strftime('%H:%M')+'][FATAL ERROR] Line Notify Error: (Remove Stale)')

        time.sleep(10)

#play blackground music
import subprocess
import threading

def callback():
    process = subprocess.run(['python', 'play-background-music.py'])

if play_background_music:
    thread = threading.Thread(target=callback)
    thread.start()





#main loop
pygame.mixer.init()
#pygame.mixer.music.load(os.path.join(music_path, 'kpop'+sound_ext))
#pygame.mixer.music.set_volume(0.03)
#pygame.mixer.music.play(loops=-1)

search_array = [
#   [['keyword1','keyword2', 'keyword3'], ['filename_1', 'filename_2']],
#   keyword1 and keyword2 and keyword 3 => reply with filename_1 or filename_2 randomly

    #[['ปลายทาง'], []],



    [['ผช','แถม'], ['1แถม1_ตอบโปร 1แถม1']],
    [['แถม', 'ของ'], ['1แถม1_ตอบโปร 1แถม1']],
    [['1', 'แถม', '30'], ['ตะกร้าที่_9']],

    [['1', 'แถม'], ['1แถม1_ตอบโปร 1แถม1']],

    [['2', 'แถม', '3'], ['2แถม3_ตอบ โปร 2แถม3']],

    [['ผญ', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผญ_5 กลิ่นผู้หญิง อยู่ในตะกร้าที่ 1']],
    [['ผู้หญิง', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผญ_5 กลิ่นผู้หญิง อยู่ในตะกร้าที่ 1']],
    [['เซกซี่', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผญ_5 กลิ่นผู้หญิง อยู่ในตะกร้าที่ 1']],
    [['ปิคนิค', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผญ_5 กลิ่นผู้หญิง อยู่ในตะกร้าที่ 1']],
    [['สวีท', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผญ_5 กลิ่นผู้หญิง อยู่ในตะกร้าที่ 1']],
    [['วู้ด', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผญ_5 กลิ่นผู้หญิง อยู่ในตะกร้าที่ 1']],
    [['วูด', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผญ_5 กลิ่นผู้หญิง อยู่ในตะกร้าที่ 1']],
    [['บลูม', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผญ_5 กลิ่นผู้หญิง อยู่ในตะกร้าที่ 1']],
    [['กา', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผญ_5 กลิ่นผู้หญิง อยู่ในตะกร้าที่ 1']],
    [['เด้น', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผญ_5 กลิ่นผู้หญิง อยู่ในตะกร้าที่ 1']],

    [['ผช', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผช_คอลเลคชั่นผู้ชาย ตะกร้า 5']],
    [['ผู้ชาย', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผช_คอลเลคชั่นผู้ชาย ตะกร้า 5']],
    [['tender', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผช_คอลเลคชั่นผู้ชาย ตะกร้า 5']],
    [['เทนเดอ', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผช_คอลเลคชั่นผู้ชาย ตะกร้า 5']],
    [['onyx', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผช_คอลเลคชั่นผู้ชาย ตะกร้า 5']],
    [['โอนิค', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผช_คอลเลคชั่นผู้ชาย ตะกร้า 5']],
    [['ออนิค', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผช_คอลเลคชั่นผู้ชาย ตะกร้า 5']],
    [['exceed', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผช_คอลเลคชั่นผู้ชาย ตะกร้า 5']],
    [['เอกซีด', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผช_คอลเลคชั่นผู้ชาย ตะกร้า 5']],
    [['เอ้กซีด', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_ผช_คอลเลคชั่นผู้ชาย ตะกร้า 5']],


    [['หนังสือ', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_หนังสือ_คอลหนังสือ ตะกร้า 6']],
    [['สมุด', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_หนังสือ_คอลหนังสือ ตะกร้า 6']],
    [['ตินี', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_หนังสือ_คอลหนังสือ ตะกร้า 6']],
    [['ชาร์ม', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_หนังสือ_คอลหนังสือ ตะกร้า 6']],
    [['เบล', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_หนังสือ_คอลหนังสือ ตะกร้า 6']],
    [['สีม่วง', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_หนังสือ_คอลหนังสือ ตะกร้า 6']],
    [['สีส้ม', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_หนังสือ_คอลหนังสือ ตะกร้า 6']],


    [['ใหม่', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['ดรีม', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['dream', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['cloud', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['คลาว', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['คราว', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],

    [['คิส', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['kiss', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['more', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['มอร์', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['มาย', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['วิช', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['my', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['wish', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],

    [['แพช', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['เลิฟ', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['passi', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],
    [['love', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_แมทีเรียลเกิร์ล_คอลใหม่ ตะกร้า 8']],

    [['หนาว', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_คอลหนาว ตะกร้า 7']],
    [['เมม', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_คอลหนาว ตะกร้า 7']],
    [['คัด', 'ตะกร้า', 'ไหน'], ['ตะกร้าไหน_คอลหนาว ตะกร้า 7']],


    #[['เทส', 'เลือก'], []]
    [['เทส', 'เลือก'], ['1แถม1_ตอบโปร 1แถม1']],
    [['แถม', 'เลือก'], ['1แถม1_ตอบโปร 1แถม1']],
    [['คละ','กลิ่น'], ['1แถม1_ตอบโปร 1แถม1']],


    [['ทะเล', 'ผู้ชาย'],['onyx_ตอบ โอนิก']],
    [['ทะเล', 'ผช'],['onyx_ตอบ โอนิก']],
    [['ทะเล', 'ครับ'],['onyx_ตอบ โอนิก']],
    [['ทะเล', 'คับ'],['onyx_ตอบ โอนิก']],
    [['กลางคืน', 'ผู้ชาย'],['onyx_ตอบ โอนิก']],
    [['กลางคืน', 'ผช'],['onyx_ตอบ โอนิก']],
    [['กลางคืน', 'ครับ'],['onyx_ตอบ โอนิก']],
    [['กลางคืน', 'คับ'],['onyx_ตอบ โอนิก']],
    [['โรงเรียน', 'ผู้ชาย'], ['exceed_ตอบ เอกซีด']],
    [['โรงเรียน', 'ผช'], ['exceed_ตอบ เอกซีด']],
    [['โรงเรียน', 'คับ'], ['exceed_ตอบ เอกซีด']],
    [['โรงเรียน', 'ครับ'], ['exceed_ตอบ เอกซีด']],
    [['ออฟฟิต', 'ผู้ชาย'], ['exceed_ตอบ เอกซีด']],
    [['ออฟฟิต', 'ผช'], ['exceed_ตอบ เอกซีด']],
    [['ออฟฟิต', 'คับ'], ['exceed_ตอบ เอกซีด']],
    [['ออฟฟิต', 'ครับ'], ['exceed_ตอบ เอกซีด']],    
    [['มหาลัย', 'ผู้ชาย'], ['exceed_ตอบ เอกซีด']],
    [['มหาลัย', 'ผช'], ['exceed_ตอบ เอกซีด']],
    [['มหาลัย', 'คับ'], ['exceed_ตอบ เอกซีด']],
    [['มหาลัย', 'ครับ'], ['exceed_ตอบ เอกซีด']],
    [['ทำงาน', 'ผู้ชาย'], ['exceed_ตอบ เอกซีด']],
    [['ทำงาน', 'ผช'], ['exceed_ตอบ เอกซีด']],
    [['ทำงาน', 'คับ'], ['exceed_ตอบ เอกซีด']],
    [['ทำงาน', 'ครับ'], ['exceed_ตอบ เอกซีด']],
    [['สดชื่น', 'ผู้ชาย'], ['exceed_ตอบ เอกซีด']],
    [['สดชื่น', 'ผช'], ['exceed_ตอบ เอกซีด']],
    [['สดชื่น', 'คับ'], ['exceed_ตอบ เอกซีด']],
    [['สดชื่น', 'ครับ'], ['exceed_ตอบ เอกซีด']],
    [['สะอาด', 'คับ'], ['exceed_ตอบ เอกซีด']],
    [['สะอาด', 'ครับ'], ['exceed_ตอบ เอกซีด']],
    [['อาบน้ำ', 'ผู้ชาย'], ['exceed_ตอบ เอกซีด']],
    [['อาบน้ำ', 'ผช'], ['exceed_ตอบ เอกซีด']],
    [['อาบน้ำ', 'คับ'], ['exceed_ตอบ เอกซีด']],
    [['อาบน้ำ', 'ครับ'], ['exceed_ตอบ เอกซีด']],    
    [['เหงื่อ', 'ผู้ชาย'], ['tender_ตอบ เทนเดอร์']],
    [['เหงื่อ', 'ครับ'], ['tender_ตอบ เทนเดอร์']],
    [['เหงื่อ', 'คับ'], ['tender_ตอบ เทนเดอร์']],
    [['เหงื่อ', 'ผช'], ['tender_ตอบ เทนเดอร์']],
    [['ออกกำลัง', 'ผู้ชาย'], ['tender_ตอบ เทนเดอร์']],
    [['ออกกำลัง', 'ครับ'], ['tender_ตอบ เทนเดอร์']],
    [['ออกกำลัง', 'คับ'], ['tender_ตอบ เทนเดอร์']],
    [['ออกกำลัง', 'ผช'], ['tender_ตอบ เทนเดอร์']],
    [['อบอุ่น', 'ผู้ชาย'], ['tender_ตอบ เทนเดอร์']],
    [['อบอุ่น', 'ครับ'], ['tender_ตอบ เทนเดอร์']],
    [['อบอุ่น', 'คับ'], ['tender_ตอบ เทนเดอร์']],
    [['อบอุ่น', 'ผช'], ['tender_ตอบ เทนเดอร์']],
    [['หวาน', 'ผู้ชาย'], ['tender_ตอบ เทนเดอร์']],
    [['หวาน', 'ครับ'], ['tender_ตอบ เทนเดอร์']],
    [['หวาน', 'คับ'], ['tender_ตอบ เทนเดอร์']],
    [['หวาน', 'ผช'], ['tender_ตอบ เทนเดอร์']],

    [['สะอาด', 'ผญ'], ['woodsand_ตอบ วู้ดแซน']],
    [['สะอาด', 'คะ'], ['woodsand_ตอบ วู้ดแซน']],
    [['สะอาด', 'ค่ะ'], ['woodsand_ตอบ วู้ดแซน']],
    [['อาบน้ำ', 'ผญ'], ['woodsand_ตอบ วู้ดแซน']],
    [['อาบน้ำ', 'คะ'], ['woodsand_ตอบ วู้ดแซน']],
    [['อาบน้ำ'], ['woodsand_ตอบ วู้ดแซน']],
    [['ละมุน', 'ผช'], ['tender_ตอบ เทนเดอร์']],
    [['ลมุน', 'ผช'], ['tender_ตอบ เทนเดอร์']],
    [['ละมุน', 'ผู้ชาย'], ['tender_ตอบ เทนเดอร์']],
    [['ละมุน', 'ผู้ชาย'], ['tender_ตอบ เทนเดอร์']],
    [['ละมุน', 'คะ'],['dreamy_ดรีมมี่คราว','dreamy_ดรีมมี่คราว_v2']],
    [['ละมุน', 'ค่ะ'],['dreamy_ดรีมมี่คราว','dreamy_ดรีมมี่คราว_v2']],
    [['ลมุน', 'คะ'],['dreamy_ดรีมมี่คราว','dreamy_ดรีมมี่คราว_v2']],
    [['ลมุน', 'ค่ะ'],['dreamy_ดรีมมี่คราว','dreamy_ดรีมมี่คราว_v2']],
    [['สดใส'], ['แป้ง_แนะนำบอนนี่']],

    #[['ใช้ดี'],[]],
    [['sexy'], ['sexy_ตอบ กลิ่นเซกซี่']],
    [['เซ็กซี่'], ['sexy_ตอบ กลิ่นเซกซี่']],
    [['ซซ'],['sexy_ตอบ กลิ่นเซกซี่']],
    [['วนิ'],['sexy_ตอบ กลิ่นเซกซี่']],
    [['วานิ'],['sexy_ตอบ กลิ่นเซกซี่']],
    [['วนิล'],['sexy_ตอบ กลิ่นเซกซี่']],
    [['วะนิ'],['sexy_ตอบ กลิ่นเซกซี่']],
    [['วะนิล'],['sexy_ตอบ กลิ่นเซกซี่']],

    [['สายเที่ยว'],['sexy_ตอบ กลิ่นเซกซี่']],
    [['เที่ยว', 'กลางคืน'],['sexy_ตอบ กลิ่นเซกซี่']],
    [['ทะเล'],['sexy_ตอบ กลิ่นเซกซี่']],

    [['บนนี่'], ['bonnie_ตอบ กลิ่นบอนนี่โบ']],
    [['บอนนี่'], ['bonnie_ตอบ กลิ่นบอนนี่โบ']],
    [['bonn'], ['bonnie_ตอบ กลิ่นบอนนี่โบ']],
    [['bonie'], ['bonnie_ตอบ กลิ่นบอนนี่โบ']],
    [['ขนม'], ['bonnie_ตอบ กลิ่นบอนนี่โบ']],
    [['ลูกคุณหนู'], ['bonnie_ตอบ กลิ่นบอนนี่โบ']],

    [['oynx'], ['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['onyx'], ['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['โอนิค'], ['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['โอนิก'], ['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['ออนิก'], ['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['ออนิค'], ['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],

    [['wood'], ['woodsand_ตอบ วู้ดแซน']],
    [['วูด'], ['woodsand_ตอบ วู้ดแซน']], 
    [['วู้ด'], ['woodsand_ตอบ วู้ดแซน']],
    [['วุด'], ['woodsand_ตอบ วู้ดแซน']], 
    [['วู๊ด'], ['woodsand_ตอบ วู้ดแซน']], 
    [['วู๊ด'], ['woodsand_ตอบ วู้ดแซน']], 
    [['แซน'], ['woodsand_ตอบ วู้ดแซน']], 
    [['ธรรมชาติ'], ['woodsand_ตอบ วู้ดแซน']], 
    [['สาว','หล่อ'], ['woodsand_ตอบ วู้ดแซน']], 
    [['สาว','เท่'], ['woodsand_ตอบ วู้ดแซน']], 


    [['sweetie'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['picnic'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['สวีตตี้'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['สวิตตี้'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['สวีทตี้'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['สวิทตี้'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['ปิก'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['ปิค'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['นิค'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['นิก'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['รร'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['ร.ร'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['โรงเรียน'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['มัธยม'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['ม','ปลาย'], ['picnic_ตอบ สวีทตี้ปิคนิค']],

    [['ออฟฟิต'], ['picnic_ตอบ สวีทตี้ปิคนิค']],
    [['ทำงาน'], ['picnic_ตอบ สวีทตี้ปิคนิค']],


    [['blooming'], ['blooming-ตอบ กลิ่นบลูมมิ่ง']],
    [['boom'], ['blooming-ตอบ กลิ่นบลูมมิ่ง']],
    [['บูม'], ['blooming-ตอบ กลิ่นบลูมมิ่ง']],
    [['บลูมมิ่ง'], ['blooming-ตอบ กลิ่นบลูมมิ่ง']],
    [['ดอกไม้'], ['blooming-ตอบ กลิ่นบลูมมิ่ง']],
    [['หวาน','เปรี้ยว'], ['blooming-ตอบ กลิ่นบลูมมิ่ง']],
    [['ผลไม้'], ['blooming-ตอบ กลิ่นบลูมมิ่ง']],
    [['ฟลุ๊ต'], ['blooming-ตอบ กลิ่นบลูมมิ่ง']],
    [['ฟรุ๊ต'], ['blooming-ตอบ กลิ่นบลูมมิ่ง']],
    [['ฟลุต'], ['blooming-ตอบ กลิ่นบลูมมิ่ง']],
    [['ฟรุต'], ['blooming-ตอบ กลิ่นบลูมมิ่ง']],
    [['ซน'], ['blooming-ตอบ กลิ่นบลูมมิ่ง']],
    [['ขี้เล่น'], ['blooming-ตอบ กลิ่นบลูมมิ่ง']],




    [['ใหม่'], ['ตะกร้าที่_8']],
    [['หนังสือ'], ['book_ตอบ คอลหนังสือ ชาร์มมิ่ง มาตินี่']],
    [['สมุด'], ['book_ตอบ คอลหนังสือ ชาร์มมิ่ง มาตินี่']],
    [['ชาร์'], ['book_ตอบ คอลหนังสือ ชาร์มมิ่ง มาตินี่']],
    [['มิ่ง'], ['book_ตอบ คอลหนังสือ ชาร์มมิ่ง มาตินี่']],
    [['ชามิ่ง'], ['book_ตอบ คอลหนังสือ ชาร์มมิ่ง มาตินี่']],

    [['แป้ง'], ['แป้งแป้ง_กลิ่นแป้งๆ ดรีมมีคราว - บอนนี่']],
    [['เเป้ง'], ['แป้งแป้ง_กลิ่นแป้งๆ ดรีมมีคราว - บอนนี่']],

    [['ใช้','นาน'], ['ใช้นาน_ใช้ได้นาน','ใช้นาน_ใช้ได้นาน2']],


    [['tender'], ['tender_ตอบ เทนเดอร์']],
    [['เทนเดอ'], ['tender_ตอบ เทนเดอร์']],
    [['ทันเดอ'], ['tender_ตอบ เทนเดอร์']],
    [['สปอร์'], ['tender_ตอบ เทนเดอร์']],
    [['ออกกำลัง'], ['tender_ตอบ เทนเดอร์']],

    [['exceed'], ['exceed_ตอบ เอกซีด']],
    [['exced'], ['exceed_ตอบ เอกซีด']],
    [['exeed'], ['exceed_ตอบ เอกซีด']],
    [['เอ๊ก'], ['exceed_ตอบ เอกซีด']],
    [['เอก'], ['exceed_ตอบ เอกซีด']],
    [['เอ้ก'], ['exceed_ตอบ เอกซีด']],
    
    [['สั่ง','แล้'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั่ง','เเล้'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั่ง','ละ'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั่ง','ไป'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั่ง','ร้อย'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั่ง','เรียบ'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั้ง','แล้'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั้ง','เเล้'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั้ง','ละ'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั้ง','ไป'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั้ง','ร้อย'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั้ง','เรียบ'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั่ง','ส่ง'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],

    [['ดูฟ'], ['ดุฟ_ดุฟรวมทั้งหมด']],
    [['ดุฟ'], ['ดุฟ_ดุฟรวมทั้งหมด']],
    [['ดูป'], ['ดุฟ_ดุฟรวมทั้งหมด']],
    [['ดุป'], ['ดุฟ_ดุฟรวมทั้งหมด']],
    [['กลิ่น', 'คล้าย'], ['ดุฟ_ดุฟรวมทั้งหมด']],
    [['กลิ่น', 'เทียบ'], ['ดุฟ_ดุฟรวมทั้งหมด']],

    [['ส่ง','จาก'], ['ส่งจาก_ส่งจากเชียงใหม่']],
    [['จังหวัด'], ['ส่งจาก_ส่งจากเชียงใหม่']],

    [['ขนส่ง'],['ขนส่ง_ขนส่ง']],

    [['จัดส่ง'],['กี่วัน_จัดส่ง_ครบ_เคลม']],
    [['กี่','วัน'],['กี่วัน_จัดส่ง_ครบ_เคลม']],
    [['ส่ง','วัน'],['กี่วัน_จัดส่ง_ครบ_เคลม']],
    [['ส่ง','ของ'],['กี่วัน_จัดส่ง_ครบ_เคลม']],

    [['ติด','ทน'],['ติดทน_ติดทนนานไม']],
    [['ติด','นาน'],['ติดทน_ติดทนนานไม']],
    [['ทน','กี่'],['ติดทน_ติดทนนานไม']],
    [['ทน','ไหม'],['ติดทน_ติดทนนานไม']],
    [['ทน','ป่าว'],['ติดทน_ติดทนนานไม']],
    [['ทน','ปล่าว'],['ติดทน_ติดทนนานไม']],
    [['ทน','รึ'],['ติดทน_ติดทนนานไม']],
    [['ทน'],['ติดทน_ติดทนนานไม']],

    [['unisex'], ['unisex_ใช้ได้ทั้งผญ_ผช']],
    [['ผช','ผญ'], ['unisex_ใช้ได้ทั้งผญ_ผช']],
    [['ชาย','หญิง'], ['unisex_ใช้ได้ทั้งผญ_ผช']],
    [['ผช','หญิง'], ['unisex_ใช้ได้ทั้งผญ_ผช']],
    [['ชาย','ผญ'], ['unisex_ใช้ได้ทั้งผญ_ผช']],

    [['ผช'], ['รีวิวผช_ผช_รีวิวครบ_กลิ่นเทียบ', 'ผช_ตอบ_ตะกร้าผู้ชาย']],
    [['ผ.ช'], ['รีวิวผช_ผช_รีวิวครบ_กลิ่นเทียบ', 'ผช_ตอบ_ตะกร้าผู้ชาย']],
    [['ผู้ชาย'], ['รีวิวผช_ผช_รีวิวครบ_กลิ่นเทียบ', 'ผช_ตอบ_ตะกร้าผู้ชาย']],

    [['ผญ'], ['ผญ_รีวิว_ผู้หญิง']],
    [['ผ.ญ'], ['ผญ_รีวิว_ผู้หญิง']],
    [['ผู้หญิง'], ['ผญ_รีวิว_ผู้หญิง']],

    [['ชาร์ม'], ['ชาร์มมิ่ง_ชาร์มมิ่ง','ชาร์มมิ่ง_ชาร์มมิ่ง2']],
    [['charm'], ['ชาร์มมิ่ง_ชาร์มมิ่ง','ชาร์มมิ่ง_ชาร์มมิ่ง2']],
    [['ขวด', 'ส้ม'], ['ชาร์มมิ่ง_ชาร์มมิ่ง','ชาร์มมิ่ง_ชาร์มมิ่ง2']],

    [['มาติ'], ['มาตินี่_เซกซี่มาตินี่']],
    [['ขวด','ม่วง'], ['มาตินี่_เซกซี่มาตินี่']],
    [['martini'], ['มาตินี่_เซกซี่มาตินี่']],
    [['martiny'], ['มาตินี่_เซกซี่มาตินี่']],
    [['ไฮ','โซ'], ['มาตินี่_เซกซี่มาตินี่']],
    [['ดู','แพง'], ['มาตินี่_เซกซี่มาตินี่']],
    [['เรียบ','หรู'], ['มาตินี่_เซกซี่มาตินี่']],

    [['เติม'], ['เติม_เติมตะกร้า']],

    [['ฉุน'],['ฉุน_ไม่ฉุน_เวียน','ฉุน_กลิ่นไม่ฉุนไม่เวียนหัว']],
    [['เวียนหัว'],['ฉุน_ไม่ฉุน_เวียน','ฉุน_กลิ่นไม่ฉุนไม่เวียนหัว']],
    [['ฟุ้ง'],['ฉุน_ไม่ฉุน_เวียน','ฉุน_กลิ่นไม่ฉุนไม่เวียนหัว']],

    [['หนาว'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['memo'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['memm'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['เมม'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['แมม'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['โมรี่'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['cuddle'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['คัด','เดิ้ล'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['คัท','เดิ้ล'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['คัท','เดิ้น'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['คัด','เดิ้น'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['warm'],['วอร์มไนท์_วอร์มไนท์']],
    [['วอร์ม'],['วอร์มไนท์_วอร์มไนท์']],
    [['วอม'],['วอร์มไนท์_วอร์มไนท์']],

    [['kiss'],['kiss_Kiss me more']],
    [['คิส'],['kiss_Kiss me more']],
    [['more'],['kiss_Kiss me more']],

    [['passion'],['passion_แพชชั่นเลิฟ']],
    [['เเพช'],['passion_แพชชั่นเลิฟ']],
    [['แพช'],['passion_แพชชั่นเลิฟ']],
    [['เลิฟ'],['passion_แพชชั่นเลิฟ']],
    [['เลิป'],['passion_แพชชั่นเลิฟ']],
    [['love'],['passion_แพชชั่นเลิฟ']],

    [['mine'],['mywish_มายวิช']],
    [['wish'],['mywish_มายวิช']],
    [['มาย'],['mywish_มายวิช']],
    [['วิช'],['mywish_มายวิช']],
    [['วิด'],['mywish_มายวิช']],

    [['ดรีม'],['dreamy_ดรีมมี่คราว','dreamy_ดรีมมี่คราว_v2']],
    [['dream'],['dreamy_ดรีมมี่คราว','dreamy_ดรีมมี่คราว_v2']],
    [['คลาว'],['dreamy_ดรีมมี่คราว','dreamy_ดรีมมี่คราว_v2']],
    [['คราว'],['dreamy_ดรีมมี่คราว','dreamy_ดรีมมี่คราว_v2']],
    [['cloud'],['dreamy_ดรีมมี่คราว','dreamy_ดรีมมี่คราว_v2']],
    [['ชิล'],['dreamy_ดรีมมี่คราว','dreamy_ดรีมมี่คราว_v2']],
    [['ชิว'],['dreamy_ดรีมมี่คราว','dreamy_ดรีมมี่คราว_v2']],

    [['แท้'], ['แท้_✅Geniune 3']],
    [['เเท้'], ['แท้_✅Geniune 3']],
    [['บัตร','แทน'], ['แท้_✅Geniune 3']],
    [['บัตร','เเทน'], ['แท้_✅Geniune 3']],

    [['กะล่อน'], ['กะล่อน_กลิ่นฟลุ้คกะล่อน']],
    [['กะร่อน'], ['กะล่อน_กลิ่นฟลุ้คกะล่อน']],
    [['ฟลุ๊ก'], ['กะล่อน_กลิ่นฟลุ้คกะล่อน']],
    [['ฟลุ้ก'], ['กะล่อน_กลิ่นฟลุ้คกะล่อน']],
    [['ฟลุ็ก'], ['กะล่อน_กลิ่นฟลุ้คกะล่อน']],


    
    [['ขายดี','ผช'],['ขายดีผช_น้ำหอม_ผช']],
    [['ขายดี','ผู้ชาย'],['ขายดีผช_น้ำหอม_ผช']],
    [['แนะนำ','ผช'],['ขายดีผช_น้ำหอม_ผช']],
    [['แนะนำ','ผู้ชาย'],['ขายดีผช_น้ำหอม_ผช']],
    [['แนะนำ','ครับ'],['ขายดีผช_น้ำหอม_ผช']],
    [['นิยม','ผช'],['ขายดีผช_น้ำหอม_ผช']],

    [['ขายดี','คะ'],['ขายดี_บลูมมิ่ง_เซกซี่']],
    [['ขายดี','ค่ะ'],['ขายดี_บลูมมิ่ง_เซกซี่']],
    [['ขายดี','ค่า'],['ขายดี_บลูมมิ่ง_เซกซี่']],
    [['แนะนำ','คะ'],['ขายดี_บลูมมิ่ง_เซกซี่']],
    [['แนะนำ','ค่ะ'],['ขายดี_บลูมมิ่ง_เซกซี่']],
    [['แนะนำ','ค่า'],['ขายดี_บลูมมิ่ง_เซกซี่']],
    [['นิยม','ผช'],['ขายดีผช_น้ำหอม_ผช']],

    [['ไม่หวาน'], ['ไม่หวาน_แนะนำวูดแซน']],
    [['สดชื่น'], ['ไม่หวาน_แนะนำวูดแซน']],
    [['กลิ่น','หวาน'], ['กลิ่นหวาน_สาวหวาน']],
    [['แป้ง'], ['แป้ง_แนะนำบอนนี่']],
    [['กลิ่น','อ่อน'],['แป้ง_แนะนำบอนนี่']],
    [['ไป','เรียน'],['แป้ง_แนะนำบอนนี่']],
    [['ไป','ทำงาน'],['แป้ง_แนะนำบอนนี่']],
    [['เหงื่อ'], ['แป้ง_แนะนำบอนนี่']],
    [['คุณหนู'],['แป้ง_แนะนำบอนนี่']],
    [['มหาลัย'],['แป้ง_แนะนำบอนนี่']],
    [['ออฟฟิต'],['แป้ง_แนะนำบอนนี่']],
    [['เที่ยว','กลางคืน'],['เที่ยวกลางคืน_แนะนำเซกซี่']],
    [['เที่ยว','ผับ'],['เที่ยวกลางคืน_แนะนำเซกซี่']],
    [['หัน','มอง'],['เที่ยวกลางคืน_แนะนำเซกซี่']], 

    [['ขายดี'],['ขายดี_ตอบ_5_ขายดีแต่ละคอลเลคชั่น']],
    [['แนะนำ'],['ขายดี_ตอบ_5_ขายดีแต่ละคอลเลคชั่น']],
    [['เเนะนำ'],['ขายดี_ตอบ_5_ขายดีแต่ละคอลเลคชั่น']],
    [['นิยม'],['ขายดีผช_น้ำหอม_ผช']],

    [['กลิ่น','หอม'],['ขายดี_บลูมมิ่ง_เซกซี่']],
    [['กลิ่นไหน','หอม'],['ขายดี_บลูมมิ่ง_เซกซี่']],
    [['กลิ่นใหน','หอม'],['ขายดี_บลูมมิ่ง_เซกซี่']],

    [['หอม','หวาน'], ['kiss_Kiss me more']], 


    [['ตะกร้า', '10'],['ตะกร้าที่_10']],
    [['ตะกร้า', '1'],['ตะกร้าที่_1']],
    #[['ตะกร้า', '2'],['ตะกร้าที่_2']],
    [['ตะกร้า', '4'],['ตะกร้าที่_4']],
    [['ตะกร้า', '5'],['ตะกร้าที่_5']],
    [['ตะกร้า', '6'],['ตะกร้าที่_6']],
    [['ตะกร้า', '7'],['ตะกร้าที่_7']],
    [['ตะกร้า', '8'],['ตะกร้าที่_8']],
    [['ตะกร้า', '9'],['ตะกร้าที่_9']],

    [['ตระกร้า', '10'],['ตะกร้าที่_10']],
    [['ตระกร้า', '1'],['ตะกร้าที่_1']],
    #[['ตระกร้า', '2'],['ตะกร้าที่_2']],
    [['ตระกร้า', '4'],['ตะกร้าที่_4']],
    [['ตระกร้า', '5'],['ตะกร้าที่_5']],
    [['ตระกร้า', '6'],['ตะกร้าที่_6']],
    [['ตระกร้า', '7'],['ตะกร้าที่_7']],
    [['ตระกร้า', '8'],['ตะกร้าที่_8']],
    [['ตระกร้า', '9'],['ตะกร้าที่_9']],


    [['ตะกร้า', '3'],['ตะกร้าที่_3']],
    [['ตระกร้า', '3'],['ตะกร้าที่_3']],

    [['ตก', '10'],['ตะกร้าที่_10']],
    [['ตก', '1'],['ตะกร้าที่_1']],
    #[['ตระกร้า', '2'],['ตะกร้าที่_2']],
    [['ตก', '4'],['ตะกร้าที่_4']],
    [['ตก', '5'],['ตะกร้าที่_5']],
    [['ตก', '6'],['ตะกร้าที่_6']],
    [['ตก', '7'],['ตะกร้าที่_7']],
    [['ตก', '8'],['ตะกร้าที่_8']],
    [['ตก', '9'],['ตะกร้าที่_9']],
    [['ตก', '3'],['ตะกร้าที่_3']],
    [['ตก', '3'],['ตะกร้าที่_3']],

    #[['1','กับ','8'], ['ตะกร้า1กับ8_ตอบกลับ 1 กับ 8 ต่างกันไง']],
    #[['1','และ','8'], ['ตะกร้า1กับ8_ตอบกลับ 1 กับ 8 ต่างกันไง']],

    [['2','กับ','9'], ['ตะกร้า2กับ9_ตะกร้า 2กับ9 ต่างกันยังไง']],
    [['2','และ','9'], ['ตะกร้า2กับ9_ตะกร้า 2กับ9 ต่างกันยังไง']],

    [['อธิบาย','ทุก'],['ผญ_รีวิว_ผู้หญิง']],
    [['รีวิว','ทุก'],['ผญ_รีวิว_ผู้หญิง']],
    [['แนะ','ทุก'],['ผญ_รีวิว_ผู้หญิง']],

    [['ได้','ไม่','ครบ'],['ได้ไม่ครบ_ตอบกลับ_เคลม']],
    [['ได้','ไม่','ตรง'],['ได้ไม่ครบ_ตอบกลับ_เคลม']],
    [['ส่ง','ผิด','กลิ่น'],['ได้ไม่ครบ_ตอบกลับ_เคลม']],


    [['กลิ่น','ของแถม'],['กลิ่นของแถม_ตอบกลับ_กลิ่นของแถม']],
    [['แถม', 'สี'], ['กลิ่นของแถม_ตอบกลับ_กลิ่นของแถม']],
    [['แถม', 'มา'], ['กลิ่นของแถม_ตอบกลับ_กลิ่นของแถม']],
    [['เทส', 'สี'], ['กลิ่นของแถม_ตอบกลับ_กลิ่นของแถม']],
    [['แถม', 'กลิ่น'], ['กลิ่นของแถม_ตอบกลับ_กลิ่นของแถม']],
    [['ทดลอง', 'กลิ่น'], ['กลิ่นของแถม_ตอบกลับ_กลิ่นของแถม']],
    [['ทดลอง', 'สี'], ['กลิ่นของแถม_ตอบกลับ_กลิ่นของแถม']],

    [['ml'], ['ml_ขนาด_30_กับ_2']],
    [['กี่', 'กรัม'], ['ml_ขนาด_30_กับ_2']],
    [['ขนาด'], ['ml_ขนาด_30_กับ_2']],

    [['แทป','วน'], ['เทป_ไม่ใช่เทปวนซ้ำ']],
    [['วน','ซ้ำ'], ['เทป_ไม่ใช่เทปวนซ้ำ']],
    [['เปิด','แทป'], ['เทป_ไม่ใช่เทปวนซ้ำ']],
    [['เปิด','วน'], ['เทป_ไม่ใช่เทปวนซ้ำ']],
    [['เปิด','ซ้ำ'], ['เทป_ไม่ใช่เทปวนซ้ำ']],

    [['แถม'], ['1แถม1_โปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 2']],
    [['เเถม'], ['1แถม1_โปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 2']],

    [['สี', 'น้ำหอม'],['สีน้ำหอม_ตอบ สีน้ำหอม']],
    [['สี', 'เปลี่ยน'],['สีน้ำหอม_ตอบ สีน้ำหอม']],

    [['ได้','แล้ว'], ['ได้รับแล้ว_ตอบกลับ_ขอบคุณ ได้รับของแล้ว']],
    [['ได้','เเล้ว'], ['ได้รับแล้ว_ตอบกลับ_ขอบคุณ ได้รับของแล้ว']],

    [['หอม','มาก'], ['หอมมาก_ตอบกลับ_ขอบคุณ รีวิว 5 ดาว']],

    [['ไม่','ตอบ'], ['ไม่ตอบ_ตอบกลับ_ตอบแชททันที']],
    [['ตอบ','แชท','หน่อย'], ['ไม่ตอบ_ตอบกลับ_ตอบแชททันที']],

    [['ตี','กลับ'], ['แอด_แอดมินตอบ']],
    [['โอน','ไม่'], ['แอด_แอดมินตอบ']],
    [['ไม่','รับ'], ['แอด_แอดมินตอบ']],


    [['แอด'], ['แอด_แอดมินตอบ']],
    [['เเอด'], ['แอด_แอดมินตอบ']],

]

i = 0
while(True):
    #main loop
    main = pygame.mixer.Sound(os.path.join(loop_path, clips[i]))
    print('['+time.strftime('%H:%M')+'][Loop] ' + clips[i] + ' [' + str(int(main.get_length())) + 's]')
    pygame.mixer.Channel(0).queue(main)
    #main.set_volume(0)
    pygame.mixer.Channel(0).play(main)

    while pygame.mixer.get_busy():
        # Comment Found
        speech_queue = os.listdir(comment_path)
        #chats = requests.get("https://line.ininit.com/chats")
        #if(chats):
        #    chats = chats.json()["chats"]
        #    if(len(chats)):
        #        for chat in chats:
        #            tts = gTTS(chat['text'], lang='th')
        #
        #            filename = str(int(time.time())) + '_' + chat['text']
        #            #filename = ''.join(e for e in filename if e.isalnum())
        #            tts.save(os.path.join(comment_path, filename +'.ogg'))
        #
        if len(speech_queue) > 0:
            time.sleep(0.5)
            # if there is speech, pause main loop
            for speech in speech_queue:
                speech_filename = speech

                #pygame.mixer.Channel(0).pause()
                pygame.mixer.Channel(0).stop()
                reply_file = -1
                try:
                    q = pygame.mixer.Sound(os.path.join(comment_path, speech_filename))
                    print('['+time.strftime('%H:%M')+'][Chat] ' + speech_filename + ' [' + str(int(q.get_length())) + 's]')
                    pygame.mixer.Channel(1).play(q)
                except:
                    print('['+time.strftime('%H:%M')+'][ERROR] Reading file error', speech_filename)

                try:
                    #q = pygame.mixer.Sound('comment\\'+speech)
                    #pygame.mixer.pause()
                    #pygame.time.wait(int(q.get_length()*1000))
                    #q.play()
                    speech = speech.split("_")[1:]
                    speech = '_'.join(speech)

                    while pygame.mixer.Channel(1).get_busy():
                        time.sleep(1)
                    
                    #print("[TRY] playing comment done")
                    for search in search_array:
                        found_all = True
                        for keyword in search[0]:
                            if not (keyword in speech.lower()):
                                found_all = False
                                break
                        if found_all:
                            reply_file = search[1][int(random.random()*100) % len(search[1])]
                            break
                    #print("[TRY] searching for done", reply_file)

                    if(reply_file != -1):
                        try:
                            r = requests.post(url, headers=headers, data = {'message': 'ตอบกลับ ' + reply_file})
                        except:
                            print('['+time.strftime('%H:%M')+'][ERROR] Line Notify ERROR')

                        reply_file = reply_file + sound_ext
                        #print("[TRY] reply with ", reply_file)

                        if not os.path.exists(os.path.join(reply_path, reply_file)):
                            print("[ERROR] Missing reply file", reply_file)
                            os.remove(os.path.join(comment_path, speech_filename))
                            #print('['+time.strftime('%H:%M')+'][Main] : resume ' + clips[i])
                            #pygame.mixer.Channel(0).unpause()
                            continue

                        reply = pygame.mixer.Sound(os.path.join(reply_path, reply_file))

                        print('['+time.strftime('%H:%M')+'][Reply] play ' + reply_file + ' [' + str(int(reply.get_length())) + 's]')
                        #reply.set_volume(main_volume)
                        pygame.mixer.Channel(1).play(reply)
                        
                        while pygame.mixer.Channel(1).get_busy():
                            time.sleep(1)
                    else:
                        print('['+time.strftime('%H:%M')+'][NO REPLY]')

                        #ERROR Remove Speech File and reset reply_file
                        os.remove(os.path.join(comment_path, speech_filename))
                        reply_file = -1

                        ##r = requests.post(url, headers=headers, data = {'message': 'ไม่มีคำตอบสำหรับ ' + speech})
  
                    #print('['+time.strftime('%H:%M')+'][Loop] resume ' + clips[i])
                    #pygame.mixer.Channel(0).unpause()

                    time.sleep(1)
                    os.remove(os.path.join(comment_path, speech_filename))

                except FileNotFoundError:
                    time.sleep(1)

                    try:
                        if reply_file != -1:
                            print("[ERROR] FileNotFoundError:", os.path.join(reply_path, reply_file))
                            ##r = requests.post(url, headers=headers, data = {'message': 'Error: ตรวจสอบว่ามีไฟล์คำตอบจริงไหม ' + reply_file + ' จากคำถาม ' + speech})

                            if os.path.exists(os.path.join(comment_path, speech_filename)):
                                os.remove(os.path.join(comment_path, speech_filename))
                                print("[ERROR] The comment file has been removed", speech_filename)

                                #os.rename(os.path.join(comment_path, speech), os.path.join(comment_error_path, speech))
                                #print("[ERR] The file has been moved to error directory")
                    except:
                        time.sleep(1)
                        #r = requests.post(url, headers=headers, data = {'message': 'Error: ' + reply_file})
                    finally:
                        pygame.mixer.Channel(0).unpause()
        time.sleep(2)

    # play next clip
    i = (i + 1) % len(clips)
