import time
import os
os.environ['PYGAME_HIDE_SUPPORT_PROMPT'] = "hide"
clips = os.listdir('loop')

from gtts import gTTS

import pygame
import random

#Line Notify
import requests


url = 'https://notify-api.line.me/api/notify'
token = 'AQaMH3QBpt26fMtJajb0FAusthjXwAhZ7eMcDGZuriT'
headers = {'content-type':'application/x-www-form-urlencoded','Authorization':'Bearer '+token}
#main_volume = 0.05

reply_path = 'reply'
comment_path = 'comment'
comment_error_path = 'error'

loop_path = 'loop'

sound_ext = '.ogg'

play_background_music = False

# Remove stale_comments
stale_comments = os.listdir(comment_path)
for file in stale_comments:
    os.remove(os.path.join(comment_path, file))

#play blackground music
import subprocess
import threading

def callback():
    process = subprocess.run(['python', 'play-background-music.py'])

if play_background_music:
    thread = threading.Thread(target=callback)
    thread.start()





#main loop
pygame.mixer.init()
#pygame.mixer.music.load(os.path.join(music_path, 'kpop'+sound_ext))
#pygame.mixer.music.set_volume(0.03)
#pygame.mixer.music.play(loops=-1)

search_array = [
#   [['keyword1','keyword2', 'keyword3'], ['filename_1', 'filename_2']],
#   keyword1 and keyword2 and keyword 3 => reply with filename_1 or filename_2 randomly

    #[['ปลายทาง'], []],

    [['แถม', 'สี'], ['แอด_แอดมินตอบ']],
    [['แถม', 'มา'], ['แอด_แอดมินตอบ']],
    [['เทส', 'สี'], ['แอด_แอดมินตอบ']],
    [['แถม', 'กลิ่น'], ['แอด_แอดมินตอบ']],

    [['ผช','แถม'], ['1แถม1_โปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 2']],
    [['แถม', 'ของ'], ['1แถม1_โปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 2']],
    [['1', 'แถม'], ['1แถม1_โปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 2']],
    [['1', 'เเถม'], ['1แถม1_โปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 2']],

    #[['เทส', 'เลือก'], []]
    [['เทส', 'เลือก'], ['1แถม1_โปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 2']],
    [['แถม', 'เลือก'], ['1แถม1_โปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 2']],
    [['คละ','กลิ่น'], ['1แถม1_โปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 2']],

    [['ทะเล', 'ผู้ชาย'],['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['ทะเล', 'ผช'],['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['ทะเล', 'ครับ'],['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['ทะเล', 'คับ'],['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['กลางคืน', 'ผู้ชาย'],['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['กลางคืน', 'ผช'],['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['กลางคืน', 'ครับ'],['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['กลางคืน', 'คับ'],['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['โรงเรียน', 'ผู้ชาย'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['โรงเรียน', 'ผช'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['โรงเรียน', 'คับ'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['โรงเรียน', 'ครับ'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['ออฟฟิต', 'ผู้ชาย'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['ออฟฟิต', 'ผช'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['ออฟฟิต', 'คับ'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['ออฟฟิต', 'ครับ'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],    
    [['มหาลัย', 'ผู้ชาย'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['มหาลัย', 'ผช'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['มหาลัย', 'คับ'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['มหาลัย', 'ครับ'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['ทำงาน', 'ผู้ชาย'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['ทำงาน', 'ผช'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['ทำงาน', 'คับ'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['ทำงาน', 'ครับ'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['สดชื่น', 'ผู้ชาย'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['สดชื่น', 'ผช'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['สดชื่น', 'คับ'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['สดชื่น', 'ครับ'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['เหงื่อ', 'ผู้ชาย'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['เหงื่อ', 'ครับ'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['เหงื่อ', 'คับ'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['เหงื่อ', 'ผช'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['ออกกำลัง', 'ผู้ชาย'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['ออกกำลัง', 'ครับ'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['ออกกำลัง', 'คับ'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['ออกกำลัง', 'ผช'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['อบอุ่น', 'ผู้ชาย'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['อบอุ่น', 'ครับ'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['อบอุ่น', 'คับ'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['อบอุ่น', 'ผช'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['หวาน', 'ผู้ชาย'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['หวาน', 'ครับ'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['หวาน', 'คับ'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['หวาน', 'ผช'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],

    #[['ใช้ดี'],[]],
    [['sexy'], ['ซซ_รีวิวเซกซี่']],
    [['เซ็กซี่'], ['ซซ_รีวิวเซกซี่']],
    [['ซซ'],['ซซ_รีวิวเซกซี่']],
    [['วนิลา'],['ซซ_รีวิวเซกซี่']],
    [['สายเที่ยว'],['ซซ_รีวิวเซกซี่']],
    [['เที่ยว', 'กลางคืน'],['ซซ_รีวิวเซกซี่']],
    [['ทะเล'],['ซซ_รีวิวเซกซี่']],

    [['กลิ่นไหน','หอม'],['ขายดี_บลูมมิ่ง_เซกซี่']],

    [['บนนี่'], ['บอนนี่_รีวิวบอนนี่']],
    [['บอนนี่'], ['บอนนี่_รีวิวบอนนี่']],
    [['bonn'], ['บอนนี่_รีวิวบอนนี่']],
    [['bonie'], ['บอนนี่_รีวิวบอนนี่']],
    [['ขนม'], ['บอนนี่_รีวิวบอนนี่']],
    [['แป้ง'], ['บอนนี่_รีวิวบอนนี่']],
    [['เเป้ง'], ['บอนนี่_รีวิวบอนนี่']],
    [['ลูกคุณหนู'], ['บอนนี่_รีวิวบอนนี่']],

    [['oynx'], ['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['onyx'], ['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['โอนิค'], ['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['โอนิก'], ['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['ออนิก'], ['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],
    [['ออนิค'], ['onyx_สำหรับonyx_1','onyx_สำหรับonyx_2']],

    [['sweetie'], ['ปิคนิค_ปิคนิคดีที่สุด','ปิคนิค_ปิคนิค1']],
    [['picnic'], ['ปิคนิค_ปิคนิคดีที่สุด','ปิคนิค_ปิคนิค1']],
    [['สวีตตี้'], ['ปิคนิค_ปิคนิคดีที่สุด','ปิคนิค_ปิคนิค1']],
    [['สวิตตี้'], ['ปิคนิค_ปิคนิคดีที่สุด','ปิคนิค_ปิคนิค1']],
    [['สวีทตี้'], ['ปิคนิค_ปิคนิคดีที่สุด','ปิคนิค_ปิคนิค1']],
    [['สวิทตี้'], ['ปิคนิค_ปิคนิคดีที่สุด','ปิคนิค_ปิคนิค1']],
    [['ปิก'], ['ปิคนิค_ปิคนิคดีที่สุด','ปิคนิค_ปิคนิค1']],
    [['ปิค'], ['ปิคนิค_ปิคนิคดีที่สุด','ปิคนิค_ปิคนิค1']],
    [['นิค'], ['ปิคนิค_ปิคนิคดีที่สุด','ปิคนิค_ปิคนิค1']],
    [['นิก'], ['ปิคนิค_ปิคนิคดีที่สุด','ปิคนิค_ปิคนิค1']],
    [['รร'], ['ปิคนิค_ปิคนิคดีที่สุด','ปิคนิค_ปิคนิค1']],
    [['โรงเรียน'], ['ปิคนิค_ปิคนิคดีที่สุด','ปิคนิค_ปิคนิค1']],
    [['ออฟฟิต'], ['ปิคนิค_ปิคนิคดีที่สุด','ปิคนิค_ปิคนิค1']],
    [['ทำงาน'], ['ปิคนิค_ปิคนิคดีที่สุด','ปิคนิค_ปิคนิค1']],


    [['blooming'], ['บลุมมื่ง_บลุมมื่ง']],
    [['boom'], ['บลุมมื่ง_บลุมมื่ง']],
    [['บูม'], ['บลุมมื่ง_บลุมมื่ง']],
    [['บลูมมิ่ง'], ['บลุมมื่ง_บลุมมื่ง']],

    [['wood'], ['วูดแซน_วูดแซน']],
    [['วูด'], ['วูดแซน_วูดแซน']], 
    [['วู้ด'], ['วูดแซน_วูดแซน']],
    [['วุด'], ['วูดแซน_วูดแซน']], 

    [['กลิ่นใหม่'], ['หนังสือ_รีวิวหนังสือ']],
    [['หนังสือ'], ['หนังสือ_รีวิวหนังสือ']],
    [['สมุด'], ['หนังสือ_รีวิวหนังสือ']],

    [['ใช้','นาน'], ['ใช้นาน_ใช้ได้นาน','ใช้นาน_ใช้ได้นาน2']],


    [['tender'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],
    [['เทนเดอ'], ['tender_สำหรับtender_1', 'tender_สำหรับtender_2']],

    [['exceed'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['exced'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['เอ๊กซ'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['เอกซ'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['เอก'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],
    [['เอ้ก'], ['exceed_สำหรับกลิ่นexceed_1','exceed_สำหรับกลิ่นexceed_2']],

    [['สั่ง','เเล้ว'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั่ง','แล้ว'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั่ง','ละ'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],
    [['สั่ง','ไป'],['สั่งแล้ว_สั่งแล้ว1','สั่งแล้ว_สั่งแล้ว2']],

    [['ดูฟ'], ['ดุฟ_ดุฟรวมทั้งหมด']],
    [['ดุฟ'], ['ดุฟ_ดุฟรวมทั้งหมด']],
    [['ดูป'], ['ดุฟ_ดุฟรวมทั้งหมด']],
    [['ดุป'], ['ดุฟ_ดุฟรวมทั้งหมด']],
    [['กลิ่น', 'คล้าย'], ['ดุฟ_ดุฟรวมทั้งหมด']],
    [['กลิ่น', 'เทียบ'], ['ดุฟ_ดุฟรวมทั้งหมด']],

    [['ส่ง','จาก'], ['ส่งจาก_ส่งจากเชียงใหม่']],

    [['ขนส่ง'],['ขนส่ง_ขนส่ง']],

    [['จัดส่ง'],['กี่วัน_จัดส่ง_ครบ_เคลม']],
    [['กี่','วัน'],['กี่วัน_จัดส่ง_ครบ_เคลม']],
    [['ส่ง','วัน'],['กี่วัน_จัดส่ง_ครบ_เคลม']],
    [['ส่ง','ของ'],['กี่วัน_จัดส่ง_ครบ_เคลม']],

    [['ติด','ทน'],['ติดทน_ติดทนนานไม']],
    [['ติด','นาน'],['ติดทน_ติดทนนานไม']],
    [['ทน','กี่'],['ติดทน_ติดทนนานไม']],

    [['unisex'], ['unisex_ใช้ได้ทั้งผญ_ผช']],
    [['ผช','ผญ'], ['unisex_ใช้ได้ทั้งผญ_ผช']],
    [['ชาย','หญิง'], ['unisex_ใช้ได้ทั้งผญ_ผช']],
    [['ผช','หญิง'], ['unisex_ใช้ได้ทั้งผญ_ผช']],
    [['ชาย','ผญ'], ['unisex_ใช้ได้ทั้งผญ_ผช']],

    [['ผช'], ['รีวิวผช_ผช_รีวิวครบ_กลิ่นเทียบ', 'ผช_ตอบ_ตะกร้าผู้ชาย']],
    [['ผู้ชาย'], ['รีวิวผช_ผช_รีวิวครบ_กลิ่นเทียบ', 'ผช_ตอบ_ตะกร้าผู้ชาย']],

    [['ผญ'], ['ผญ_รีวิว_ผู้หญิง']],
    [['ผู้หญิง'], ['ผญ_รีวิว_ผู้หญิง']],

    [['ชาร์ม'], ['ชาร์มมิ่ง_ชาร์มมิ่ง','ชาร์มมิ่ง_ชาร์มมิ่ง2']],
    [['charm'], ['ชาร์มมิ่ง_ชาร์มมิ่ง','ชาร์มมิ่ง_ชาร์มมิ่ง2']],
    [['ขวด', 'ส้ม'], ['ชาร์มมิ่ง_ชาร์มมิ่ง','ชาร์มมิ่ง_ชาร์มมิ่ง2']],

    [['มาติ'], ['มาตินี่_เซกซี่มาตินี่']],
    [['ขวด','ม่วง'], ['มาตินี่_เซกซี่มาตินี่']],
    [['martini'], ['มาตินี่_เซกซี่มาตินี่']],
    [['martiny'], ['มาตินี่_เซกซี่มาตินี่']],

    [['เติม'], ['เติม_เติมตะกร้า']],

    [['ฉุน'],['ฉุน_ไม่ฉุน_เวียน','ฉุน_กลิ่นไม่ฉุนไม่เวียนหัว']],
    [['เวียนหัว'],['ฉุน_ไม่ฉุน_เวียน','ฉุน_กลิ่นไม่ฉุนไม่เวียนหัว']],

    [['หนาว'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['memory'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['เมมโม'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['โมรี่'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['cuddle'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['คัด','เดิ้ล'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['คัท','เดิ้ล'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['คัท','เดิ้น'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['คัด','เดิ้น'],['หนาว_คอลหน้าหนาว','หนาว_คอลหน้าหนาว2']],
    [['warm'],['วอร์มไนท์_วอร์มไนท์']],
    [['วอร์ม'],['วอร์มไนท์_วอร์มไนท์']],
    [['วอม'],['วอร์มไนท์_วอร์มไนท์']],

    [['แท้'], ['แท้_✅Geniune 3']],
    [['เเท้'], ['แท้_✅Geniune 3']],

    [['กะล่อน'], ['กะล่อน_กลิ่นฟลุ้คกะล่อน']],
    [['กะร่อน'], ['กะล่อน_กลิ่นฟลุ้คกะล่อน']],
    [['ฟลุ๊ก'], ['กะล่อน_กลิ่นฟลุ้คกะล่อน']],
    [['ฟลุ้ก'], ['กะล่อน_กลิ่นฟลุ้คกะล่อน']],
    [['ฟลุ็ก'], ['กะล่อน_กลิ่นฟลุ้คกะล่อน']],


    [['ไม่หวาน'], ['ไม่หวาน_แนะนำวูดแซน']],
    [['สดชื่น'], ['ไม่หวาน_แนะนำวูดแซน']],
    [['กลิ่น','หวาน'], ['กลิ่นหวาน_สาวหวาน']],
    [['แป้ง'], ['แป้ง_แนะนำบอนนี่']],
    [['กลิ่น','อ่อน'],['แป้ง_แนะนำบอนนี่']],
    [['ไป','เรียน'],['แป้ง_แนะนำบอนนี่']],
    [['ไป','ทำงาน'],['แป้ง_แนะนำบอนนี่']],
    [['เหงื่อ'], ['แป้ง_แนะนำบอนนี่']],
    [['คุณหนู'],['แป้ง_แนะนำบอนนี่']],
    [['มหาลัย'],['แป้ง_แนะนำบอนนี่']],
    [['ออฟฟิต'],['แป้ง_แนะนำบอนนี่']],
    [['เที่ยว','กลางคืน'],['เที่ยวกลางคืน_แนะนำเซกซี่']],
    [['เที่ยว','ผับ'],['เที่ยวกลางคืน_แนะนำเซกซี่']],
    [['หัน','มอง'],['เที่ยวกลางคืน_แนะนำเซกซี่']],

    [['ขายดี','ผช'],['ขายดีผช_น้ำหอม_ผช']],
    [['ขายดี','ผู้ชาย'],['ขายดีผช_น้ำหอม_ผช']],
    [['แนะนำ','ผช'],['ขายดีผช_น้ำหอม_ผช']],
    [['แนะนำ','ผู้ชาย'],['ขายดีผช_น้ำหอม_ผช']],
    [['แนะนำ','ครับ'],['ขายดีผช_น้ำหอม_ผช']],

    [['ขายดี','คะ'],['ขายดี_บลูมมิ่ง_เซกซี่']],
    [['ขายดี','ค่ะ'],['ขายดี_บลูมมิ่ง_เซกซี่']],
    [['ขายดี','ค่า'],['ขายดี_บลูมมิ่ง_เซกซี่']],
    [['แนะนำ','คะ'],['ขายดี_บลูมมิ่ง_เซกซี่']],
    [['แนะนำ','ค่ะ'],['ขายดี_บลูมมิ่ง_เซกซี่']],
    [['แนะนำ','ค่า'],['ขายดี_บลูมมิ่ง_เซกซี่']],

    [['ขายดี'],['ขายดี_ตอบ_5_ขายดีแต่ละคอลเลคชั่น']],
    [['แนะนำ'],['ขายดี_ตอบ_5_ขายดีแต่ละคอลเลคชั่น']],
    [['เเนะนำ'],['ขายดี_ตอบ_5_ขายดีแต่ละคอลเลคชั่น']],

    [['ตะกร้า', '10'],['ตะกร้าที่_10']],
    [['ตะกร้า', '1'],['ตะกร้าที่_1']],
    [['ตะกร้า', '2'],['ตะกร้าที่_2']],
    [['ตะกร้า', '3'],['ตะกร้าที่_3']],
    [['ตะกร้า', '4'],['ตะกร้าที่_4']],
    [['ตะกร้า', '5'],['ตะกร้าที่_5']],
    [['ตะกร้า', '6'],['ตะกร้าที่_6']],
    [['ตะกร้า', '7'],['ตะกร้าที่_7']],
    [['ตะกร้า', '8'],['ตะกร้าที่_8']],
    [['ตะกร้า', '9'],['ตะกร้าที่_9']],

    [['ตระกร้า', '10'],['ตะกร้าที่_10']],
    [['ตระกร้า', '1'],['ตะกร้าที่_1']],
    [['ตระกร้า', '2'],['ตะกร้าที่_2']],
    [['ตระกร้า', '3'],['ตะกร้าที่_3']],
    [['ตระกร้า', '4'],['ตะกร้าที่_4']],
    [['ตระกร้า', '5'],['ตะกร้าที่_5']],
    [['ตระกร้า', '6'],['ตะกร้าที่_6']],
    [['ตระกร้า', '7'],['ตะกร้าที่_7']],
    [['ตระกร้า', '8'],['ตะกร้าที่_8']],
    [['ตระกร้า', '9'],['ตะกร้าที่_9']],

    [['1','กับ','8'], ['ตะกร้า1กับ8_ตอบ ตะกร้า 1 และ 8']],
    [['1','และ','8'], ['ตะกร้า1กับ8_ตอบ ตะกร้า 1 และ 8']],

    [['2','กับ','9'], ['ตะกร้า2กับ9_ตะกร้า 2 กับ 9', 'ตะกร้า2กับ9_ตะกร้าที่ 2 ตะกร้า 9']],
    [['2','และ','9'], ['ตะกร้า2กับ9_ตะกร้า 2 กับ 9', 'ตะกร้า2กับ9_ตะกร้าที่ 2 ตะกร้า 9']],

    [['อธิบาย','ทุก'],['ผญ_รีวิว_ผู้หญิง']],
    [['รีวิว','ทุก'],['ผญ_รีวิว_ผู้หญิง']],
    [['แนะ','ทุก'],['ผญ_รีวิว_ผู้หญิง']],

    [['ได้','ไม่','ครบ'],['ปัญหา_แตก_ไม่ครบ']],
    [['ได้','ไม่','ครบ'],['ปัญหา_แตก_ไม่ครบ']],

    [['ml'], ['ml_ขนาด_30_กับ_2']],
    [['คละ','กลิ่น'], ['can_be_mixed_1','can_be_mixed_2']],

    [['แทป','วน'], ['เทป_ไม่ใช่เทปวนซ้ำ']],
    [['วน','ซ้ำ'], ['เทป_ไม่ใช่เทปวนซ้ำ']],
    [['เปิด','แทป'], ['เทป_ไม่ใช่เทปวนซ้ำ']],
    [['เปิด','วน'], ['เทป_ไม่ใช่เทปวนซ้ำ']],
    [['เปิด','ซ้ำ'], ['เทป_ไม่ใช่เทปวนซ้ำ']],

    [['แถม'], ['1แถม1_โปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 2']],
    [['เเถม'], ['1แถม1_โปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 1', '1แถม1_ตอบกลับโปร 1 แถม 2']],

    [['แอด'], ['แอด_แอดมินตอบ']],
    [['เเอด'], ['แอด_แอดมินตอบ']],

]

i = 0
while(True):
    #main loop
    main = pygame.mixer.Sound(os.path.join(loop_path, clips[i]))
    print('['+time.strftime('%H:%M')+'][Loop] ' + clips[i] + ' [' + str(int(main.get_length())) + 's]')
    pygame.mixer.Channel(0).queue(main)
    #main.set_volume(0)
    pygame.mixer.Channel(0).play(main)

    while pygame.mixer.get_busy():
        # Comment Found
        speech_queue = os.listdir(comment_path)
        #chats = requests.get("https://line.ininit.com/chats")
        #if(chats):
        #    chats = chats.json()["chats"]
        #    if(len(chats)):
        #        for chat in chats:
        #            tts = gTTS(chat['text'], lang='th')
        #
        #            filename = str(int(time.time())) + '_' + chat['text']
        #            #filename = ''.join(e for e in filename if e.isalnum())
        #            tts.save(os.path.join(comment_path, filename +'.ogg'))
        #
        if len(speech_queue) > 0:
            time.sleep(0.5)
            # if there is speech, pause main loop
            for speech in speech_queue:
                speech_filename = speech

                try:
                    pygame.mixer.Channel(0).pause()
                    reply_file = ''

                    q = pygame.mixer.Sound(os.path.join(comment_path, speech_filename))

                    print('['+time.strftime('%H:%M')+'][Speech] ' + speech_filename + ' [' + str(int(q.get_length())) + 's]')
                    pygame.mixer.Channel(1).play(q)
                    #q = pygame.mixer.Sound('comment\\'+speech)
                    #pygame.mixer.pause()
                    #pygame.time.wait(int(q.get_length()*1000))
                    #q.play()
                    speech = speech.split("_")[1:]
                    speech = '_'.join(speech)

                    while pygame.mixer.Channel(1).get_busy():
                        time.sleep(1)
                    
                    #print("[TRY] playing comment done")
                    for search in search_array:
                        found_all = True
                        for keyword in search[0]:
                            if not (keyword in speech.lower()):
                                found_all = False
                                break
                        if found_all:
                            reply_file = search[1][int(random.random()*100) % len(search[1])]
                            break
                    #print("[TRY] searching for done", reply_file)

                    if(reply_file != ''):
                        r = requests.post(url, headers=headers, data = {'message': 'ตอบกลับ ' + reply_file})
                        reply_file = reply_file + sound_ext
                        #print("[TRY] reply with ", reply_file)

                        if not os.path.exists(os.path.join(reply_path, reply_file)):
                            print("[ERROR] Missing reply file", reply_file)
                            os.remove(os.path.join(comment_path, speech_filename))
                            print('['+time.strftime('%H:%M')+'][Main] : resume ' + clips[i])
                            pygame.mixer.Channel(0).unpause()
                            continue

                        reply = pygame.mixer.Sound(os.path.join(reply_path, reply_file))

                        print('['+time.strftime('%H:%M')+'][Reply] play ' + reply_file + ' [' + str(int(reply.get_length())), 's]')
                        #reply.set_volume(main_volume)
                        pygame.mixer.Channel(1).play(reply)
                        
                        while pygame.mixer.Channel(1).get_busy():
                            time.sleep(1)
                        reply_file = ''
                        
                    print('['+time.strftime('%H:%M')+'][Loop] resume ' + clips[i])
                    pygame.mixer.Channel(0).unpause()

                    time.sleep(1)
                    os.remove(os.path.join(comment_path, speech_filename))

                except FileNotFoundError:
                    time.sleep(1)

                    try:
                        print("[ERROR] FileNotFoundError:", os.path.join(reply_path, reply_file))
                        r = requests.post(url, headers=headers, data = {'message': 'Error: ตรวจสอบว่ามีไฟล์คำตอบจริงไหม ' + reply_file})

                        if os.path.exists(os.path.join(comment_path, speech_filename)):
                            os.remove(os.path.join(comment_path, speech_filename))
                            print("[ERROR] The comment file has been removed", speech_filename)

                            #os.rename(os.path.join(comment_path, speech), os.path.join(comment_error_path, speech))
                            #print("[ERR] The file has been moved to error directory")
                    except:
                        time.sleep(1)
                        #r = requests.post(url, headers=headers, data = {'message': 'Error: ' + reply_file})
                    finally:
                        pygame.mixer.Channel(0).unpause()
        time.sleep(2)

    # play next clip
    i = (i + 1) % len(clips)
